test/Lagrangian/injections/0/Lagrangian/particle/d
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianScalarField;
    location    "0/Lagrangian/particle";
    object      d;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [length];

internalField   uniform 1e-3;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            calculated;
    }
}

sources
{
    volumeInjection
    {
        type            distribution;
        distribution
        {
            type            RosinRammler;
            Q               0;
            min             0.1 [mm];
            max             1.5 [mm];
            d               1.4 [mm];
            n               2 [];
        }
    }

    patchInjection
    {
        type            uniformFixedValue;
        uniformValue    500 [um];
    }

    diskInjection
    {
        type            uniformFixedValue;
        uniformValue    500 [um];
    }
}


// ************************************************************************* //
